app/views/fighters/_form.html.erb

SELECT "games".* FROM "games"
---
    <%= f.label "Included in the Following Games:" %><br><br>
    <%= f.collection_check_boxes :game_ids, Game.all, :id, :name %>