app/views/fighters/_form.html.erb

SELECT "games"."id" FROM "games" INNER JOIN "fighters_games" ON "games"."id" = "fighters_games"."game_id" WHERE "fighters_games"."fighter_id" = $1  [["fighter_id", 61]]
---
    <%= f.label :game_id %>
    <%= f.select :game_ids, Game.pluck(:name, :id), :include_blank => true %>