app/views/fighters/show.html.erb

                <strong>Games:</strong><br>
                <% if @fighter.games.present? %>
---
SELECT "games".* FROM "games" INNER JOIN "fighters_games" ON "games"."id" = "fighters_games"."game_id" WHERE "fighters_games"."fighter_id" = $1  [["fighter_id", 82]]

            <li><strong>Special Moves:</strong><br>
                <% if @fighter.specials.any? %>
                    <ol>
                    <% @fighter.specials.each do |special| %>
---
SELECT "specials".* FROM "specials" WHERE "specials"."fighter_id" = $1  [["fighter_id", 82]]
SELECT  1 AS one FROM "specials" WHERE "specials"."fighter_id" = $1 LIMIT $2  [["fighter_id", 126], ["LIMIT", 1]]
SELECT "specials".* FROM "specials" WHERE "specials"."fighter_id" = $1  [["fighter_id", 120]]

            <div class="post_image_section">
                <%= post.user.profile_image.present? ? image_tag(post.user.profile_image, :class => "post_user_image") : image_tag("/assets/no_image.png", :class => "post_user_image")%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]

                <div class="div_break"></div>
                <p>Liked by: <%= post.likes.count %> user(s)</p>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 74]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 52]]

                <% if @current_user.present? %>
                    <% if @current_user.likes.any? { |like| like.post.id == post.id } %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 74]]