app/views/users/show.html.erb

            <% end %>
            <% @user.posts.sort.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 75]]

            <% end %>
            <% if @user.likes.present? %>
                <% @user.likes.sort.each do |like| %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 75]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 77]]

                        <p><%= like.post.content %></p>
                        <%= image_tag like.post.image if like.post.image.present? %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]