app/views/games/show.html.erb

            <strong>Fighters:</strong><br>
            <% @game.fighters.each do |fighter| %>
---
SELECT "fighters".* FROM "fighters" INNER JOIN "fighters_games" ON "fighters"."id" = "fighters_games"."fighter_id" WHERE "fighters_games"."game_id" = $1  [["game_id", 2]]

            <div class="post_image_section">
                <%= post.user.profile_image.present? ? image_tag(post.user.profile_image, :class => "post_user_image") : image_tag("/assets/no_image.png", :class => "post_user_image")%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]

                <div class="div_break"></div>
                <p>Liked by: <%= post.likes.count %> user(s)</p>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 74]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 54]]

                <% if @current_user.present? %>
                    <% if @current_user.likes.any? { |like| like.post.id == post.id } %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 74]]