app/views/specials/_form.html.erb

    <%= f.label :fighter_id %>
    <%= f.select :fighter_id, Fighter.pluck(:name, :id), :include_blank => true %>
---
SELECT "fighters"."name", "fighters"."id" FROM "fighters"