app/views/specials/index.html.erb

        <div class="inner_container">
        <% if fighter.specials.present? %>
            <% fighter.specials.each do |special| %>
---
SELECT  1 AS one FROM "specials" WHERE "specials"."fighter_id" = $1 LIMIT $2  [["fighter_id", 77], ["LIMIT", 1]]
SELECT "specials".* FROM "specials" WHERE "specials"."fighter_id" = $1  [["fighter_id", 77]]

        <% @specials.each do |special| %>
            <%= link_to image_tag(special.preview, :class => "special_select"), special if special.preview.present? && special.fighter.present? == false %>
---
SELECT  "fighters".* FROM "fighters" WHERE "fighters"."id" = $1 LIMIT $2  [["id", 77], ["LIMIT", 1]]