app/views/specials/index.html.erb

SELECT "fighters".* FROM "fighters"
---
        <% @specials.each do |special| %>
            <%= link_to image_tag(special.preview, :class => "special_select"), special if special.preview.present? && special.fighter.id == fighter.id %>