app/views/specials/show.html.erb

SELECT  "fighters".* FROM "fighters" WHERE "fighters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<div class="profile">
    <h2><% if @special.fighter.present? %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
            <div class="post_image_section">
                <%= post.user.profile_image.present? ? image_tag(post.user.profile_image, :class => "post_user_image") : image_tag("/assets/no_image.png", :class => "post_user_image")%>

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 74]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 56]]
---
                <div class="div_break"></div>
                <p>Liked by: <%= post.likes.count %> user(s)</p>

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 74]]
---
                <% if @current_user.present? %>
                    <% if @current_user.likes.any? { |like| like.post.id == post.id } %>