app/controllers/fighters_controller.rb

SELECT "fighters".* FROM "fighters"
---
  def index
    @fighters = Fighter.all

INSERT INTO "fighters" ("name", "stock_symbol", "availability", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Cloud"], ["stock_symbol", ""], ["availability", "Unlockable"], ["image", ""], ["created_at", "2020-03-21 05:37:05.210395"], ["updated_at", "2020-03-21 05:37:05.210395"]]
UPDATE "fighters" SET "updated_at" = $1, "entry_created" = $2 WHERE "fighters"."id" = $3  [["updated_at", "2020-03-23 17:39:42.571542"], ["entry_created", "2020-03-23 17:39:42.569704"], ["id", 125]]
---
  def create
    fighter = Fighter.create fighter_params
    binding.pry
    fighter.entry_created = Time.zone.now
    fighter.save

SELECT  "fighters".* FROM "fighters" WHERE "fighters"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
---
  def edit
    @fighter = Fighter.find params[:id]

SELECT  "fighters".* FROM "fighters" WHERE "fighters"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
UPDATE "fighters" SET "final_smash" = $1, "updated_at" = $2 WHERE "fighters"."id" = $3  [["final_smash", "https://www.ssbwiki.com/images/5/5c/Cloud_Final_Smash_SSBU.gif"], ["updated_at", "2020-03-22 15:31:19.083019"], ["id", 82]]
---
  def update
    fighter = Fighter.find params[:id]
    fighter.update fighter_params

SELECT  "fighters".* FROM "fighters" WHERE "fighters"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
---
  def show
    @fighter = Fighter.find params[:id]

SELECT  "fighters".* FROM "fighters" WHERE "fighters"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
DELETE FROM "fighters" WHERE "fighters"."id" = $1  [["id", 63]]
---
  def destroy
    fighter = Fighter.find params[:id]
    fighter.destroy