app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 52], ["user_id", 74], ["created_at", "2020-03-23 19:18:03.747451"], ["updated_at", "2020-03-23 19:18:03.747451"]]
UPDATE "likes" SET "updated_at" = $1, "liked_on" = $2 WHERE "likes"."id" = $3  [["updated_at", "2020-03-23 20:06:20.567300"], ["liked_on", "2020-03-23 20:06:20.565799"], ["id", 11]]
---
    def create
        like = @post.likes.create(user_id: @current_user.id)
        like.liked_on = Time.now
        like.save

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 6]]
---
    def destroy
        @like.destroy

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["post_id", 56], ["post_id", 56], ["LIMIT", 1]]
---
    def find_like
        @like = @post.likes.find_by(post_id: params[:post_id])