app/controllers/pages_controller.rb

SELECT  "fighters".* FROM "fighters" ORDER BY entry_created DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "specials".* FROM "specials" ORDER BY entry_created DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @latest_fighter = Fighter.order("entry_created").last
    @latest_special = Special.order("entry_created").last

SELECT "fighters"."id" FROM "fighters" WHERE (name LIKE '%Wolf%')
SELECT "specials"."id" FROM "specials" WHERE (name LIKE '%Derp%')
SELECT "games"."id" FROM "games" WHERE (name LIKE '%Cloud%')
SELECT "fighters".* FROM "fighters"
---
  def search
    @category = special_params[:category]
    @search_string = params[:search]
    @search_ids = case @category
    when "fighters"
      Fighter.where("name LIKE ?","%#{@search_string.downcase.capitalize}%").pluck(:id)
    when "specials"
      Special.where("name LIKE ?","%#{@search_string.downcase.capitalize}%").pluck(:id)
    when "games"
      Game.where("name LIKE ?","%#{@search_string.downcase.capitalize}%").pluck(:id)
    end
    @potential_results = case @category
    when "fighters"
      Fighter.all