app/controllers/posts_controller.rb

    def create
        post = Post.create post_params
        post.date_posted = Time.now
        post.save
---
INSERT INTO "posts" ("user_id", "game_id", "content", "created_at", "updated_at", "image", "article_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 50], ["game_id", 85], ["content", "Best game yet!"], ["created_at", "2020-03-22 19:31:54.393529"], ["updated_at", "2020-03-22 19:31:54.393529"], ["image", ""], ["article_type", "game"]]
UPDATE "posts" SET "date_posted" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["date_posted", "2020-03-22 17:29:36.063274"], ["updated_at", "2020-03-22 17:29:36.063962"], ["id", 1]]

    def update
        post = Post.find params[:id]
        post.update post_params
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "user_id" = $2, "fighter_id" = $3, "game_id" = $4, "special_id" = $5, "article_type" = $6, "updated_at" = $7 WHERE "posts"."id" = $8

    def destroy
      @post = Post.find params[:id]
      @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 10]]