app/controllers/specials_controller.rb

  def index
    @fighters = Fighter.all
    @specials = Special.all
---
SELECT "fighters".* FROM "fighters"
SELECT "specials".* FROM "specials"

  def create
    special = Special.create special_params
    special.entry_created = Time.zone.now
    special.save
---
INSERT INTO "specials" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cross Slash"], ["created_at", "2020-03-20 00:29:06.136915"], ["updated_at", "2020-03-20 00:29:06.136915"]]
UPDATE "specials" SET "updated_at" = $1, "entry_created" = $2 WHERE "specials"."id" = $3  [["updated_at", "2020-03-20 00:29:06.143970"], ["entry_created", "2020-03-20"], ["id", 201]]

  def edit
    @special = Special.find params[:id]
---
SELECT  "specials".* FROM "specials" WHERE "specials"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]

  def update
    special = Special.find params[:id]
    special.update special_params
---
SELECT  "specials".* FROM "specials" WHERE "specials"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]
UPDATE "specials" SET "fighter_id" = $1, "updated_at" = $2 WHERE "specials"."id" = $3  [["fighter_id", 61], ["updated_at", "2020-03-21 05:49:07.021525"], ["id", 242]]

  def show
    @special = Special.find params[:id]
---
SELECT  "specials".* FROM "specials" WHERE "specials"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]