app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.create user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]
UPDATE "users" SET "nickname" = $1, "profile_image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["nickname", ""], ["profile_image", ""], ["updated_at", "2020-03-23 19:48:14.159011"], ["id", 75]]
---
  def update
    user = User.find params[:id]
    user.update user_profile_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]
---
  def destroy
    user = User.find params[:id]
    flash[:update] = "#{user.email}'s Smash wiki membership has been revoked!"
    user.destroy